DeveloperTools/apiBCCR.ipynb

{
    "metadata": {
        "kernelspec": {
            "name": "python3",
            "display_name": "Python 3",
            "language": "python"
        },
        "language_info": {
            "name": "python",
            "version": "3.9.0",
            "mimetype": "text/x-python",
            "codemirror_mode": {
                "name": "ipython",
                "version": 3
            },
            "pygments_lexer": "ipython3",
            "nbconvert_exporter": "python",
            "file_extension": ".py"
        }
    },
    "nbformat_minor": 2,
    "nbformat": 4,
    "cells": [
        {
            "cell_type": "code",
            "source": [
                "#Libraries\n",
                "\n",
                "import requests\n",
                "import json\n",
                "import xml\n",
                "from xml.etree import ElementTree\n",
                "import urllib\n",
                "from bs4 import BeautifulSoup\n",
                "from bccr import SW  "
            ],
            "metadata": {
                "azdata_cell_guid": "9304fdc0-1b3c-456d-a460-42f04ee15aba"
            },
            "outputs": [],
            "execution_count": 4
        },
        {
            "cell_type": "code",
            "source": [
                "# Create parameterized url Usin beautiful soup\n",
                "\n",
                "indicador = \"317\"\n",
                "fechainicio = \"08/04/2021\"\n",
                "fechafinal = \"08/04/2021\"\n",
                "nombre = \"esteban\"\n",
                "subniveles = \"S\"\n",
                "email = \"ecervantes@cmvlatam.com\"\n",
                "token = \"RST0LAENO8\"\n",
                "\n",
                "\n",
                "request_url = \"http://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx/ObtenerIndicadoresEconomicos?Indicador=\"+indicador+\"&FechaInicio=\"+fechainicio+\"&FechaFinal=\"+fechafinal+\"&Nombre=\"+nombre+\"&SubNiveles=\"+subniveles+\"&CorreoElectronico=\"+email+\"&Token=\"+token+\" HTTP/1.1\"\n",
                "\n",
                "    "
            ],
            "metadata": {
                "azdata_cell_guid": "3fbd468f-9f4a-4548-bacf-fe71bf988692"
            },
            "outputs": [],
            "execution_count": 2
        },
        {
            "cell_type": "code",
            "source": [
                "# Submit request and format output\n",
                "\n",
                "response_data = requests.get(request_url).json()\n",
                "print(json.dumps(response_data, indent=4))"
            ],
            "metadata": {
                "azdata_cell_guid": "a5f193e2-d1ba-42dd-a4b8-a712b5c96c6d"
            },
            "outputs": [],
            "execution_count": null
        },
        {
            "cell_type": "code",
            "source": [
                "https://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx"
            ],
            "metadata": {
                "azdata_cell_guid": "4b78de40-3c2d-4add-b701-7a77159bd710"
            },
            "outputs": [
                {
                    "output_type": "error",
                    "ename": "SyntaxError",
                    "evalue": "invalid syntax (<ipython-input-145-9aae8e0ba7da>, line 1)",
                    "traceback": [
                        "\u001b[1;36m  File \u001b[1;32m\"<ipython-input-145-9aae8e0ba7da>\"\u001b[1;36m, line \u001b[1;32m1\u001b[0m\n\u001b[1;33m    https://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx\u001b[0m\n\u001b[1;37m           ^\u001b[0m\n\u001b[1;31mSyntaxError\u001b[0m\u001b[1;31m:\u001b[0m invalid syntax\n"
                    ]
                }
            ],
            "execution_count": 145
        },
        {
            "cell_type": "code",
            "source": [
                "\n",
                "https://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx\n",
                "GET /Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx HTTP/1.1\n"
            ],
            "metadata": {
                "azdata_cell_guid": "62fe5904-9120-49a1-9813-de7bdc003812"
            },
            "outputs": [
                {
                    "output_type": "error",
                    "ename": "SyntaxError",
                    "evalue": "invalid syntax (<ipython-input-146-eb1ed9f0557b>, line 1)",
                    "traceback": [
                        "\u001b[1;36m  File \u001b[1;32m\"<ipython-input-146-eb1ed9f0557b>\"\u001b[1;36m, line \u001b[1;32m1\u001b[0m\n\u001b[1;33m    https://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx\u001b[0m\n\u001b[1;37m           ^\u001b[0m\n\u001b[1;31mSyntaxError\u001b[0m\u001b[1;31m:\u001b[0m invalid syntax\n"
                    ]
                }
            ],
            "execution_count": 146
        },
        {
            "cell_type": "code",
            "source": [
                "response_data['text']"
            ],
            "metadata": {
                "azdata_cell_guid": "5087aa05-a1d3-461d-a170-3b08458d74d6"
            },
            "outputs": [],
            "execution_count": null
        },
        {
            "cell_type": "code",
            "source": [
                "import requests\n",
                "url=\"https://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx\"\n",
                "#headers = {'content-type': 'application/soap+xml'}\n",
                "headers = {'content-type': 'text/xml'}\n",
                "body = \"\"\"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n",
                "            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n",
                "              <soap:Body>\n",
                "                <ObtenerIndicadoresEconomicos xmlns=\"http://ws.sdde.bccr.fi.cr\">\n",
                "                  <Indicador>3323</Indicador>\n",
                "                  <FechaInicio>08/04/2021</FechaInicio>\n",
                "                  <FechaFinal>09/04/2021</FechaFinal>\n",
                "                  <Nombre>esteban</Nombre>\n",
                "                  <SubNiveles>Y</SubNiveles>\n",
                "                  <CorreoElectronico>ecervantes@cmvlatam.com</CorreoElectronico>\n",
                "                  <Token>RST0LAENO8</Token>\n",
                "                </ObtenerIndicadoresEconomicos>\n",
                "              </soap:Body>\n",
                "            </soap:Envelope>\"\"\"\n",
                "response = requests.post(url,data=body,headers=headers)\n",
                "print(response.content)"
            ],
            "metadata": {
                "azdata_cell_guid": "c1cd0ee1-0cea-48d3-b9ae-88695f363894"
            },
            "outputs": [
                {
                    "output_type": "stream",
                    "name": "stdout",
                    "text": "b'<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><ObtenerIndicadoresEconomicosResponse xmlns=\"http://ws.sdde.bccr.fi.cr\"><ObtenerIndicadoresEconomicosResult><xs:schema id=\"Datos_de_INGC011_CAT_INDICADORECONOMIC\" xmlns=\"\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\" xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\"><xs:element name=\"Datos_de_INGC011_CAT_INDICADORECONOMIC\" msdata:IsDataSet=\"true\" msdata:UseCurrentLocale=\"true\"><xs:complexType><xs:choice minOccurs=\"0\" maxOccurs=\"unbounded\"><xs:element name=\"INGC011_CAT_INDICADORECONOMIC\"><xs:complexType><xs:sequence><xs:element name=\"COD_INDICADORINTERNO\" type=\"xs:string\" minOccurs=\"0\" /><xs:element name=\"DES_FECHA\" type=\"xs:dateTime\" minOccurs=\"0\" /><xs:element name=\"NUM_VALOR\" type=\"xs:decimal\" minOccurs=\"0\" /></xs:sequence></xs:complexType></xs:element></xs:choice></xs:complexType></xs:element></xs:schema><diffgr:diffgram xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\" xmlns:diffgr=\"urn:schemas-microsoft-com:xml-diffgram-v1\" /></ObtenerIndicadoresEconomicosResult></ObtenerIndicadoresEconomicosResponse></soap:Body></soap:Envelope>'\n"
                }
            ],
            "execution_count": 1
        },
        {
            "cell_type": "code",
            "source": [
                "import requests\n",
                "url=\"https://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx\"\n",
                "#headers = {'content-type': 'application/soap+xml'}\n",
                "headers = {'content-type': 'text/xml'}\n",
                "body = \"\"\"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n",
                "            <soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n",
                "              <soap:Body>\n",
                "                <ObtenerIndicadoresEconomicos xmlns=\"http://ws.sdde.bccr.fi.cr\">\n",
                "                  <Indicador>3323</Indicador>\n",
                "                  <FechaInicio>08/04/2021</FechaInicio>\n",
                "                  <FechaFinal>09/04/2021</FechaFinal>\n",
                "                  <Nombre>esteban</Nombre>\n",
                "                  <SubNiveles>Y</SubNiveles>\n",
                "                  <CorreoElectronico>ecervantes@cmvlatam.com</CorreoElectronico>\n",
                "                  <Token>RST0LAENO8</Token>\n",
                "                </ObtenerIndicadoresEconomicos>\n",
                "              </soap:Body>\n",
                "            </soap:Envelope>\"\"\"\n",
                "response = requests.post(url,data=body,headers=headers)\n",
                "\n",
                "\n",
                "response.text\n",
                "\n",
                "\n"
            ],
            "metadata": {
                "azdata_cell_guid": "5905979e-d20b-4fb6-9536-91be90df8115"
            },
            "outputs": [
                {
                    "output_type": "execute_result",
                    "execution_count": 15,
                    "data": {
                        "text/plain": "'<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><ObtenerIndicadoresEconomicosResponse xmlns=\"http://ws.sdde.bccr.fi.cr\"><ObtenerIndicadoresEconomicosResult><xs:schema id=\"Datos_de_INGC011_CAT_INDICADORECONOMIC\" xmlns=\"\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\" xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\"><xs:element name=\"Datos_de_INGC011_CAT_INDICADORECONOMIC\" msdata:IsDataSet=\"true\" msdata:UseCurrentLocale=\"true\"><xs:complexType><xs:choice minOccurs=\"0\" maxOccurs=\"unbounded\"><xs:element name=\"INGC011_CAT_INDICADORECONOMIC\"><xs:complexType><xs:sequence><xs:element name=\"COD_INDICADORINTERNO\" type=\"xs:string\" minOccurs=\"0\" /><xs:element name=\"DES_FECHA\" type=\"xs:dateTime\" minOccurs=\"0\" /><xs:element name=\"NUM_VALOR\" type=\"xs:decimal\" minOccurs=\"0\" /></xs:sequence></xs:complexType></xs:element></xs:choice></xs:complexType></xs:element></xs:schema><diffgr:diffgram xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\" xmlns:diffgr=\"urn:schemas-microsoft-com:xml-diffgram-v1\" /></ObtenerIndicadoresEconomicosResult></ObtenerIndicadoresEconomicosResponse></soap:Body></soap:Envelope>'"
                    },
                    "metadata": {}
                }
            ],
            "execution_count": 15
        },
        {
            "cell_type": "code",
            "source": [
                "print(response.content)"
            ],
            "metadata": {
                "azdata_cell_guid": "e5d3203d-e975-4670-8fb4-d15b198ae818"
            },
            "outputs": [
                {
                    "output_type": "stream",
                    "name": "stdout",
                    "text": "b'<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><ObtenerIndicadoresEconomicosResponse xmlns=\"http://ws.sdde.bccr.fi.cr\"><ObtenerIndicadoresEconomicosResult><xs:schema id=\"Datos_de_INGC011_CAT_INDICADORECONOMIC\" xmlns=\"\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\" xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\"><xs:element name=\"Datos_de_INGC011_CAT_INDICADORECONOMIC\" msdata:IsDataSet=\"true\" msdata:UseCurrentLocale=\"true\"><xs:complexType><xs:choice minOccurs=\"0\" maxOccurs=\"unbounded\"><xs:element name=\"INGC011_CAT_INDICADORECONOMIC\"><xs:complexType><xs:sequence><xs:element name=\"COD_INDICADORINTERNO\" type=\"xs:string\" minOccurs=\"0\" /><xs:element name=\"DES_FECHA\" type=\"xs:dateTime\" minOccurs=\"0\" /><xs:element name=\"NUM_VALOR\" type=\"xs:decimal\" minOccurs=\"0\" /></xs:sequence></xs:complexType></xs:element></xs:choice></xs:complexType></xs:element></xs:schema><diffgr:diffgram xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\" xmlns:diffgr=\"urn:schemas-microsoft-com:xml-diffgram-v1\" /></ObtenerIndicadoresEconomicosResult></ObtenerIndicadoresEconomicosResponse></soap:Body></soap:Envelope>'\n"
                }
            ],
            "execution_count": 174
        },
        {
            "cell_type": "code",
            "source": [
                "for monex_cierre in root.iter():\n",
                "    print (monex_cierre.tag,monex_cierre.attrib)"
            ],
            "metadata": {
                "azdata_cell_guid": "16dd3fc0-9743-4de3-900e-648fa8820beb"
            },
            "outputs": [
                {
                    "output_type": "stream",
                    "name": "stdout",
                    "text": "{http://schemas.xmlsoap.org/soap/envelope/}Envelope {}\n{http://schemas.xmlsoap.org/soap/envelope/}Body {}\n{http://ws.sdde.bccr.fi.cr}ObtenerIndicadoresEconomicosResponse {}\n{http://ws.sdde.bccr.fi.cr}ObtenerIndicadoresEconomicosResult {}\n{http://www.w3.org/2001/XMLSchema}schema {'id': 'Datos_de_INGC011_CAT_INDICADORECONOMIC'}\n{http://www.w3.org/2001/XMLSchema}element {'name': 'Datos_de_INGC011_CAT_INDICADORECONOMIC', '{urn:schemas-microsoft-com:xml-msdata}IsDataSet': 'true', '{urn:schemas-microsoft-com:xml-msdata}UseCurrentLocale': 'true'}\n{http://www.w3.org/2001/XMLSchema}complexType {}\n{http://www.w3.org/2001/XMLSchema}choice {'minOccurs': '0', 'maxOccurs': 'unbounded'}\n{http://www.w3.org/2001/XMLSchema}element {'name': 'INGC011_CAT_INDICADORECONOMIC'}\n{http://www.w3.org/2001/XMLSchema}complexType {}\n{http://www.w3.org/2001/XMLSchema}sequence {}\n{http://www.w3.org/2001/XMLSchema}element {'name': 'COD_INDICADORINTERNO', 'type': 'xs:string', 'minOccurs': '0'}\n{http://www.w3.org/2001/XMLSchema}element {'name': 'DES_FECHA', 'type': 'xs:dateTime', 'minOccurs': '0'}\n{http://www.w3.org/2001/XMLSchema}element {'name': 'NUM_VALOR', 'type': 'xs:decimal', 'minOccurs': '0'}\n{urn:schemas-microsoft-com:xml-diffgram-v1}diffgram {}\nDatos_de_INGC011_CAT_INDICADORECONOMIC {}\nINGC011_CAT_INDICADORECONOMIC {'{urn:schemas-microsoft-com:xml-diffgram-v1}id': 'INGC011_CAT_INDICADORECONOMIC1', '{urn:schemas-microsoft-com:xml-msdata}rowOrder': '0'}\nCOD_INDICADORINTERNO {}\nDES_FECHA {}\nNUM_VALOR {}\nINGC011_CAT_INDICADORECONOMIC {'{urn:schemas-microsoft-com:xml-diffgram-v1}id': 'INGC011_CAT_INDICADORECONOMIC2', '{urn:schemas-microsoft-com:xml-msdata}rowOrder': '1'}\nCOD_INDICADORINTERNO {}\nDES_FECHA {}\nNUM_VALOR {}\n"
                }
            ],
            "execution_count": 121
        },
        {
            "cell_type": "code",
            "source": [
                "import datetime\n",
                "import pandas as pd\n",
                "import urllib.request\n",
                "from xml.dom.minidom import parse, parseString\n",
                "import pandas_read_xml as pdx\n",
                "fecha = datetime.date.today().strftime(\"%d/%m/%Y\")\n",
                "base_url = 'https://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx/ObtenerIndicadoresEconomicosXML?Indicador={tcIndicador}&FechaInicio={tcFechaInicio}&FechaFinal={tcFechaFinal}&Nombre={tcNombre}&SubNiveles={tnSubNiveles}&CorreoElectronico={tcCorreoElectronico}&token={token}'\n",
                "data = {\n",
                "    'tcIndicador':'3323', \n",
                "    'tcFechaInicio': '08/04/2021',\n",
                "    'tcFechaFinal':'08/04/2021', \n",
                "    'tcNombre':\"esteban\", \n",
                "    'tnSubNiveles':'S',\n",
                "    'tcCorreoElectronico':'ecervantes@cmvlatam.com',\n",
                "    'token':'RST0LAENO8'\n",
                "}\n",
                "result = urllib.request.urlopen(base_url.format(**data)).read()\n",
                "\n",
                "\n",
                "\n",
                "print(result.decode('UTF8'))\n"
            ],
            "metadata": {
                "azdata_cell_guid": "f85011a7-acab-4095-b7b8-e5efd24a8808"
            },
            "outputs": [
                {
                    "output_type": "stream",
                    "name": "stdout",
                    "text": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<string xmlns=\"http://ws.sdde.bccr.fi.cr\">&lt;Datos_de_INGC011_CAT_INDICADORECONOMIC&gt;\n  &lt;INGC011_CAT_INDICADORECONOMIC&gt;\n    &lt;COD_INDICADORINTERNO&gt;3323&lt;/COD_INDICADORINTERNO&gt;\n    &lt;DES_FECHA&gt;2021-04-08T00:00:00-06:00&lt;/DES_FECHA&gt;\n    &lt;NUM_VALOR&gt;613.51000000&lt;/NUM_VALOR&gt;\n  &lt;/INGC011_CAT_INDICADORECONOMIC&gt;\n&lt;/Datos_de_INGC011_CAT_INDICADORECONOMIC&gt;</string>\n"
                }
            ],
            "execution_count": 52
        },
        {
            "cell_type": "code",
            "source": [
                "root = ET.fromstring(response.text)"
            ],
            "metadata": {
                "azdata_cell_guid": "2bda6885-cfe1-4bd2-9532-259f3ecc0238"
            },
            "outputs": [],
            "execution_count": null
        }
    ]
}